Tekla Open API Reference for Tekla Structures 2025
ProfileItem Methods
The ProfileItem type exposes the following members.
Methods
Name | Description
AddCrossSection
 Adds the cross section to a profile.
DeleteCrossSection
 Deletes the cross section of a profile.
Export
 Exports the profile item in the profile database to given file name. Currently library profiles, sketch profiles and clb profiles are supported. Library profiles are exported to *.lis format. Sketch profiles are exported to *.uel format. Clb profiles are exported to *.clb format. If path is not given profile is exported to model folder. If filename is empty profile name or prefix is used as filename.
GetCrossSection
 Returns list of cross section points of inner surfaces from the profile item.
GetHighAccuracyCrossSection
 Get cross section with high accuracy.
GetProfileItemSubTypes()
 Selects the profile item and updates the sub types in the profile database.
GetProfileItemSubTypes(ProfileItem, ProfileItem.ProfileItemTypeEnum)
IsProfileUserDefined
 Whether the profile is a fixed user-defined profile.
IsProfileUserParametric
 Whether the profile is a parametric user-defined profile. If so, the prefix can be asked by type and subtype.
ModifyCrossSection
 Modifies the cross section of a profile.
ModifyProfileItemAnalysisParameter
 Modify analysis parameter of library profile item. Modify is needed for profile item for updating changes to profile database
ModifyProfileItemParameter
 Modify parameter of library profile item. Modify is needed for profile item for updating changes to profile database
ModifyProfileItemUserParameter
 Modify user parameter of library profile item. Modify is needed for profile item for updating changes to profile database
Select
 Selects the profile item in the profile database.
SelectCrossSections
 Selects the profile item cross section in the profile database.
SetEquivalentType
 Sets the equivalent type for the specified cross section.
Top
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace